<a href="https://colab.research.google.com/github/yooste/SOLUX_summer_data/blob/master/2%EC%A3%BC%EC%B0%A8/pandas_chap13_0801.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
job_list = [{'name':'John','job':'teacher'},
            {'name':'Nate','job':'teacher'},
            {'name':'Fred','job':'teacher'},
            {'name':'Abraham','job':'student'},
            {'name':'Brian','job':'student'},
            {'name':'Jenny','job':'developer'},
            {'name':'Nate','job':'teacher'},
            {'name':'Ian','job':'teacher'},
            {'name':'Chris','job':'banker'},
            {'name':'Philip','job':'lawyer'},
            {'name':'Jenny','job':'basketball player'},
            {'name':'Gwen','job':'teacher'},
            {'name':'Jessy','job':'student'}]

df = pd.DataFrame(job_list, columns = ['name','job'])

In [3]:
df

       name                job
0      John            teacher
1      Nate            teacher
2      Fred            teacher
3   Abraham            student
4     Brian            student
5     Jenny          developer
6      Nate            teacher
7       Ian            teacher
8     Chris             banker
9    Philip             lawyer
10    Jenny  basketball player
11     Gwen            teacher
12    Jessy            student

In [4]:
df.job.unique() # job안의 value들을 중복값을 제외하고 보여준다.

array(['teacher', 'student', 'developer', 'banker', 'lawyer',
       'basketball player'], dtype=object)

In [5]:
df.job.value_counts() # job 항목의 개수를 보여준다.

teacher              6
student              3
banker               1
lawyer               1
basketball player    1
developer            1
Name: job, dtype: int64